---
kind: other
id: Methods.T:Autodesk.Revit.DB.ViewShapeBuilder
source: html/509e28ea-64a8-b53d-ff47-2111d699d3d4.htm
---
# ViewShapeBuilder Methods

Add a curve to the GRep associated to this ViewShapeBuilder.